[
    {
        "type":"Art",
        "project-id":"lampshade",
        "card-title":"Hand-Sewed and Beaded Lampshade",
        "card-subtitle":"fibers, beads",
        "collapse-images": [["resources/images/lampshade.png", "256px", "342px"]],
        "project-description":"This beautiful lampshade, crafted by hand, was made December/January 2023-2024. I found the perfect lamp stand, clothing fabric, and wire frame from Goodwill. Drawing inspiration from my observations while watching Ace of Shades, I stripped the lampshade and began the process. I sewed strips of fabric around the wire so each panel would be able to be sewn on. I repurposed fabric from a pillowcase and two shirts to make foundational panels for each section of the frame. Then I adorned the lampshade with delicate lace and intricate beadwork gathered from diverse sources—my personal collection, Joann's, and a local bead store. My finishing touch was the white trim on the top and bottom of the shade, covering all the threads from sewing each part. All that was left was to assemble my lamp!"
    },
    {
        "type":"Art",
        "project-id":"scorpionBracelet",
        "card-title":"Oragami Metal Scorpion Bracelet",
        "card-subtitle":"Nickel Silver",
        "collapse-images": [["resources/images/scorpionBracelet.JPG", "455px", "240px"]],
        "project-description":"I took a beginning metal and jewelry class fall semester 2023, and completed this scorpion bracelet. The bracelet is constructed from 24 gauge silver nickel sheet metal. I constructed the design by experimenting with paper, cutting and folding until I felt I found the best design. I had to saw out my metal, clean up the edges, sand it to remove marks from pliers and other tools I used in the process. Next, I sand-blasted and tumbled the piece to get the shiny, chrome illusion on the metal."
    },
    {
        "type":"Programming",
        "project-id":"rocket-backtracking",
        "card-title":"Rocket Backtracking",
        "card-subtitle":"Python",
        "project-description":"Practice for backtracking algorithm through practical application. The problem is a variation of the classic knapsack problem. In this variation, the task was to build a rocket using the fewest possible sections, where each section is variable length. My approach to the problem was to add up sections until they are equal to the desired total, continuously evaluating the number of sections.",
        "project-link":"https://github.com/elizabeth-johnson8888/RocketBacktracking.git"
    },
    {
        "type":"Programming",
        "project-id":"bullet-journal",
        "card-title":"Bullet Journal Website",
        "card-subtitle":"HTML, CSS, JavaScript, Bootstrap",
        "project-description":"Bullet Journals are a type of journal that people make for personal notes, goals, calendars, budgets and more. Usually they are decorated very cutely, but they are time consuming to make. I made a web application that simulates a bullet journal where users can log in and make notes and use a dynamically created calendar. I used IndexedDB and session storage to hold information about the users and their saved notes. Since it is a bullet journal, I created a JSON file with different themes that users can save for each month of the calendar so if you save a Christmas theme for December, December of that year will always be Christmas themed regardless of the themes from other months. This project was completed for a Web Application class at James Madison University.",
        "project-link":"https://w3stu.cs.jmu.edu/johns5el/cs343/Project/"
    },
    {
        "type":"Programming",
        "project-id":"max3sat",
        "card-title":"Max3Sat Exact Solution",
        "card-subtitle":"Python, Shell script",
        "project-description":"Max3Sat is a classic NP-complete problem within the realm of computational complexity. The objective of Max3Sat is to obtain the maximum count of clauses that yield a true evaluation. Each clause is written in CNF notation and each variable can be affirmed or negated. In my problem, I was given the number of variables, the number of clauses in one line, and each clause on separate input lines. Using the Brute Force algorithm, I explored all possible truth assignments for each variable and evaluated the expression. Following each evaluation, I compared the previous maximum truth count with the evaluated truth count to get the maximum number of true clauses. The algorithm prints the maximum number of clauses that are evaluated to true and the truth values that are associated with each variable. Consequently, this algorithm operates in exponential time.",
        "project-link":"https://github.com/elizabeth-johnson8888/Max3Sat.git"
    },
    {
        "type":"Art",
        "project-id":"pond-floor",
        "card-title":"Pond Mural on Floor",
        "card-subtitle":"Wall paint, acrylic paint",
        "collapse-images": [["resources/images/floor_mural.JPG", "262px", "349px"]],
        "project-description":"When my family moved into our house in high school, there was a section of the floor right in the foyer that had not been wood finished, so it was base plywood. I didn't think it looked to good so I decided to take this problem into my own hands and fix it. I asked my dad if I could paint a mural on the floor, and to my surprise, he said yes! I was inspired by our tiny pond in the backyard, and wanted to bring it inside. I painted the fish first, and then the water around them to make them pop out more, and to look like they're freely swimming in some beautiful water."
    },
    {
        "type":"Art",
        "project-id":"octopus-box",
        "card-title":"Deep Sea Treasure",
        "card-subtitle":"Paper clay, acrylic paint, 3d printed object, yarn, wood",
        "collapse-images": [["resources/images/octopus_box.JPG", "349px", "262px"]],
        "project-description":"I took a 3d-designing class at JMU and this was one of the projects. The objective was to make box with a 3d printed object that represented you. I started by making the 3d object. I decided to put an octopus queen on a star throne engulfed in flowers, eating ice cream and surrounded by flames. You see, I love octopi and the ocean, space, flowers, ice cream, and fire. The reason I put made the octopus the octopus queen is because I am the octopus, in charge of my life and queen of me. I built the box in the woodshop before staining it and using acrylic paint to make the outside look more worn. I painted the inside of the box red because that is my favorite color. My professor made paper clay, a medium that I was unfamiliar with. I was curious so I decided to implement it into my project by creating vines that wrapped around my box and held the box and the lid up at different angles. I used wire to support the vines so the box would not crumple down. To add further details, I added smaller yarn roots and painted the clay and yarn to look more wood-like. I made the outside more guarded with a peek inside, because I try to keep myself guarded, but do let people in. I imagine that my box is int he process of falling to the ocean floor, levitating from the water current, but held together by the vines."
    },
    {
        "type":"Art",
        "project-id":"dotd-painting",
        "card-title":"Great Grandmother",
        "card-subtitle":"acrylic paint",
        "collapse-images": [["resources/images/dotd_painting.jpg", "262px", "349px"]],
        "project-description":"When I was in my painting class I made a friend, Ana Leah, who was putting on a Day of the Dead gallery for Latino artists to submit work and have their art shown in SSC. She was having trouble finding artists so she asked me to make a piece for her(I am not Latino); I was thrilled. The theme was Life, Death, and Memory. At first I was unsure of what to paint. I did some research and found out that in Mexican culture, it is said that the Monarch Butterflies are spirits of their ancestors visiting them again. I think that is beautiful and it reminded me of my Great Grandma, who I was close to when I was young. She told me that after she died, she would visit me as a butterfly. I also found out that people put flowers on the altars for their family members, so I felt that I needed to include some beautiful foliage in my painting. I decided to put her in a beautiful forest full of life. In the background, there is her coffin that is overgrown with soft moss and grass. In the foreground, there is a small monarch butterfly, which represents her visiting me in the physical world."
    },
    {
        "type":"Programming",
        "project-id":"homebase-application",
        "card-title":"HomeBase GUI Application",
        "card-subtitle":"Java Swing",
        "project-description":"The HomeBase Application was completed for a Developing Multimedia course at James Madison University. It is a GUI application that shows different home viewings for the counties of Rockingham and Augusta. The some of the visual content was sampled, and some was created using Java graphics.",
        "project-link":"https://github.com/elizabeth-johnson8888/HomeBase-Application.git"
    },
    {
        "type":"Programming",
        "project-id":"circular-binary",
        "card-title":"Circular Binary Search",
        "card-subtitle":"Python",
        "project-description":"This algorithm objective was to do a binary search on a circulary sorted array.",
        "project-link":"https://github.com/elizabeth-johnson8888/CircularBinarySearch.git"
    },
    {
        "type":"Programming",
        "project-id":"min-heap",
        "card-title":"Minimum Heap lab",
        "card-subtitle":"java",
        "project-description":"This was a lab completed for a Data Structures course at James Madison University. The objective was to create a wroking minimum heap from scratch to better understand the mechanics behind the data structure.",
        "project-link":"https://github.com/elizabeth-johnson8888/DataStructures/tree/main/MinHeap"
    },
    {
        "type":"Art",
        "project-id":"octopus-cabinet",
        "card-title":"Hand-painted Octopus Cabinet",
        "card-subtitle":"Acrylic Paint",
        "collapse-images": [["resources/images/octopus_cabinet.JPG", "403px", "204px"]],
        "project-description":"My best friend's dad commissioned me to paint a cabinet for their RV camper. I was told to make it bright and interesting, so I made a neon octopus for them."
    }
]
